# Date: 2023/2/15 下午8:00

# 赋值运算符，运算顺序从右到左
i = 3 + 4
print(i)

# 链式赋值
print('----------链式赋值-----------')
a = b = c = 20
print(a, id(a))
print(b, id(b))
print(c, id(c))

# 参数赋值
print('----------参数赋值-----------')
a1 = 20
a1 += 30  # a=a+30
a1 -= 10  # a=a-10
a1 *= 2  # a=a*2
a1 /= 2  # a=a/2
a1 %= 3  # a=a%3
print(a1)

# 解包赋值
print('--------------解包赋值----------------')
a, b, c = 20, 30, 40
print(a, b, c)

print('----------交换两个变量的值-----------')
a, b = 10, 20
print('交换之前：', 'a=', a, 'b=', b)
a, b = b, a
print('交换之后：', 'a=', a, 'b=', b)
