# Date: 2023/2/17 下午6:37
'''两个集合是否相等：元素相同就相等'''
print('-----------两个集合是否相等：元素相同就相等-----------')
s1 = {10, 20, 30, 40}
s2 = {10, 20, 30, 50}
print(s1 == s2)

'''一个集合是否是另一个集合的子集'''
print('-----------一个集合是否是另一个集合的子集-----------')
s3 = {10, 20, 30, 40, 50, 60}
s4 = {10, 20, 30, 40}
s5 = {10, 20, 30, 70}
print(s4.issubset(s3))
print(s5.issubset(s3))

print('-----------一个集合是否是另一个集合的超集-----------')
print(s3.issuperset(s4))
print(s3.issuperset(s5))

print('-----------两个集合是否含有交集-----------')
print(s3.isdisjoint(s5))
